feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Prog/Libraries/Infra/Sfr/TC27D/_Reg/IfxEray_bf.h
/** \brief  Offset for Ifx_ERAY_GTUC09_Bits.MAPO */
#define IFX_ERAY_GTUC09_MAPO_OFF (8u)

/** \brief  Length for Ifx_ERAY_GTUC10_Bits.MOC */
#define IFX_ERAY_GTUC10_MOC_LEN (14u)

/** \brief  Mask for Ifx_ERAY_GTUC10_Bits.MOC */
#define IFX_ERAY_GTUC10_MOC_MSK (0x3fffu)

/** \brief  Offset for Ifx_ERAY_GTUC10_Bits.MOC */
#define IFX_ERAY_GTUC10_MOC_OFF (0u)

/** \brief  Length for Ifx_ERAY_GTUC10_Bits.MRC */
#define IFX_ERAY_GTUC10_MRC_LEN (11u)

/** \brief  Mask for Ifx_ERAY_GTUC10_Bits.MRC */
#define IFX_ERAY_GTUC10_MRC_MSK (0x7ffu)

/** \brief  Offset for Ifx_ERAY_GTUC10_Bits.MRC */
#define IFX_ERAY_GTUC10_MRC_OFF (16u)

/** \brief  Length for Ifx_ERAY_GTUC11_Bits.EOC */
#define IFX_ERAY_GTUC11_EOC_LEN (3u)

/** \brief  Mask for Ifx_ERAY_GTUC11_Bits.EOC */
#define IFX_ERAY_GTUC11_EOC_MSK (0x7u)

/** \brief  Offset for Ifx_ERAY_GTUC11_Bits.EOC */
#define IFX_ERAY_GTUC11_EOC_OFF (16u)

/** \brief  Length for Ifx_ERAY_GTUC11_Bits.EOCC */
#define IFX_ERAY_GTUC11_EOCC_LEN (2u)

/** \brief  Mask for Ifx_ERAY_GTUC11_Bits.EOCC */
#define IFX_ERAY_GTUC11_EOCC_MSK (0x3u)

/** \brief  Offset for Ifx_ERAY_GTUC11_Bits.EOCC */
#define IFX_ERAY_GTUC11_EOCC_OFF (0u)

/** \brief  Length for Ifx_ERAY_GTUC11_Bits.ERC */
#define IFX_ERAY_GTUC11_ERC_LEN (3u)

/** \brief  Mask for Ifx_ERAY_GTUC11_Bits.ERC */
#define IFX_ERAY_GTUC11_ERC_MSK (0x7u)

/** \brief  Offset for Ifx_ERAY_GTUC11_Bits.ERC */
#define IFX_ERAY_GTUC11_ERC_OFF (24u)

/** \brief  Length for Ifx_ERAY_GTUC11_Bits.ERCC */
#define IFX_ERAY_GTUC11_ERCC_LEN (2u)

/** \brief  Mask for Ifx_ERAY_GTUC11_Bits.ERCC */
#define IFX_ERAY_GTUC11_ERCC_MSK (0x3u)

/** \brief  Offset for Ifx_ERAY_GTUC11_Bits.ERCC */
#define IFX_ERAY_GTUC11_ERCC_OFF (8u)

/** \brief  Length for Ifx_ERAY_IBCM_Bits.LDSH */
#define IFX_ERAY_IBCM_LDSH_LEN (1u)

/** \brief  Mask for Ifx_ERAY_IBCM_Bits.LDSH */
#define IFX_ERAY_IBCM_LDSH_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_IBCM_Bits.LDSH */
#define IFX_ERAY_IBCM_LDSH_OFF (1u)

/** \brief  Length for Ifx_ERAY_IBCM_Bits.LDSS */
#define IFX_ERAY_IBCM_LDSS_LEN (1u)

/** \brief  Mask for Ifx_ERAY_IBCM_Bits.LDSS */
#define IFX_ERAY_IBCM_LDSS_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_IBCM_Bits.LDSS */
#define IFX_ERAY_IBCM_LDSS_OFF (17u)

/** \brief  Length for Ifx_ERAY_IBCM_Bits.LHSH */
#define IFX_ERAY_IBCM_LHSH_LEN (1u)

/** \brief  Mask for Ifx_ERAY_IBCM_Bits.LHSH */
#define IFX_ERAY_IBCM_LHSH_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_IBCM_Bits.LHSH */
#define IFX_ERAY_IBCM_LHSH_OFF (0u)

/** \brief  Length for Ifx_ERAY_IBCM_Bits.LHSS */
#define IFX_ERAY_IBCM_LHSS_LEN (1u)

/** \brief  Mask for Ifx_ERAY_IBCM_Bits.LHSS */
#define IFX_ERAY_IBCM_LHSS_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_IBCM_Bits.LHSS */
#define IFX_ERAY_IBCM_LHSS_OFF (16u)

/** \brief  Length for Ifx_ERAY_IBCM_Bits.STXRH */
#define IFX_ERAY_IBCM_STXRH_LEN (1u)

/** \brief  Mask for Ifx_ERAY_IBCM_Bits.STXRH */
#define IFX_ERAY_IBCM_STXRH_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_IBCM_Bits.STXRH */
#define IFX_ERAY_IBCM_STXRH_OFF (2u)

/** \brief  Length for Ifx_ERAY_IBCM_Bits.STXRS */
#define IFX_ERAY_IBCM_STXRS_LEN (1u)

/** \brief  Mask for Ifx_ERAY_IBCM_Bits.STXRS */
#define IFX_ERAY_IBCM_STXRS_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_IBCM_Bits.STXRS */
#define IFX_ERAY_IBCM_STXRS_OFF (18u)

/** \brief  Length for Ifx_ERAY_IBCR_Bits.IBRH */
#define IFX_ERAY_IBCR_IBRH_LEN (7u)

/** \brief  Mask for Ifx_ERAY_IBCR_Bits.IBRH */
#define IFX_ERAY_IBCR_IBRH_MSK (0x7fu)

/** \brief  Offset for Ifx_ERAY_IBCR_Bits.IBRH */
#define IFX_ERAY_IBCR_IBRH_OFF (0u)

/** \brief  Length for Ifx_ERAY_IBCR_Bits.IBRS */
#define IFX_ERAY_IBCR_IBRS_LEN (7u)

/** \brief  Mask for Ifx_ERAY_IBCR_Bits.IBRS */
#define IFX_ERAY_IBCR_IBRS_MSK (0x7fu)

/** \brief  Offset for Ifx_ERAY_IBCR_Bits.IBRS */
#define IFX_ERAY_IBCR_IBRS_OFF (16u)

/** \brief  Length for Ifx_ERAY_IBCR_Bits.IBSYH */
#define IFX_ERAY_IBCR_IBSYH_LEN (1u)

/** \brief  Mask for Ifx_ERAY_IBCR_Bits.IBSYH */
#define IFX_ERAY_IBCR_IBSYH_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_IBCR_Bits.IBSYH */
#define IFX_ERAY_IBCR_IBSYH_OFF (15u)

/** \brief  Length for Ifx_ERAY_IBCR_Bits.IBSYS */
#define IFX_ERAY_IBCR_IBSYS_LEN (1u)

/** \brief  Mask for Ifx_ERAY_IBCR_Bits.IBSYS */
#define IFX_ERAY_IBCR_IBSYS_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_IBCR_Bits.IBSYS */
#define IFX_ERAY_IBCR_IBSYS_OFF (31u)

/** \brief  Length for Ifx_ERAY_ID_Bits.MOD_REV */
#define IFX_ERAY_ID_MOD_REV_LEN (8u)

/** \brief  Mask for Ifx_ERAY_ID_Bits.MOD_REV */
#define IFX_ERAY_ID_MOD_REV_MSK (0xffu)

/** \brief  Offset for Ifx_ERAY_ID_Bits.MOD_REV */
#define IFX_ERAY_ID_MOD_REV_OFF (0u)

/** \brief  Length for Ifx_ERAY_ID_Bits.MOD_TYPE */
#define IFX_ERAY_ID_MOD_TYPE_LEN (8u)

/** \brief  Mask for Ifx_ERAY_ID_Bits.MOD_TYPE */
#define IFX_ERAY_ID_MOD_TYPE_MSK (0xffu)

/** \brief  Offset for Ifx_ERAY_ID_Bits.MOD_TYPE */
#define IFX_ERAY_ID_MOD_TYPE_OFF (8u)

/** \brief  Length for Ifx_ERAY_ID_Bits.MODNUMBER */
#define IFX_ERAY_ID_MODNUMBER_LEN (16u)

/** \brief  Mask for Ifx_ERAY_ID_Bits.MODNUMBER */
#define IFX_ERAY_ID_MODNUMBER_MSK (0xffffu)

/** \brief  Offset for Ifx_ERAY_ID_Bits.MODNUMBER */
#define IFX_ERAY_ID_MODNUMBER_OFF (16u)

/** \brief  Length for Ifx_ERAY_ILE_Bits.EINT0 */
#define IFX_ERAY_ILE_EINT0_LEN (1u)

/** \brief  Mask for Ifx_ERAY_ILE_Bits.EINT0 */
#define IFX_ERAY_ILE_EINT0_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_ILE_Bits.EINT0 */
#define IFX_ERAY_ILE_EINT0_OFF (0u)

/** \brief  Length for Ifx_ERAY_ILE_Bits.EINT1 */
#define IFX_ERAY_ILE_EINT1_LEN (1u)

/** \brief  Mask for Ifx_ERAY_ILE_Bits.EINT1 */
#define IFX_ERAY_ILE_EINT1_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_ILE_Bits.EINT1 */
#define IFX_ERAY_ILE_EINT1_OFF (1u)

/** \brief  Length for Ifx_ERAY_KRST0_Bits.RST */
#define IFX_ERAY_KRST0_RST_LEN (1u)

/** \brief  Mask for Ifx_ERAY_KRST0_Bits.RST */
#define IFX_ERAY_KRST0_RST_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_KRST0_Bits.RST */
#define IFX_ERAY_KRST0_RST_OFF (0u)

/** \brief  Length for Ifx_ERAY_KRST0_Bits.RSTSTAT */
#define IFX_ERAY_KRST0_RSTSTAT_LEN (1u)

