feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Prog/Libraries/Infra/Sfr/TC27D/_Reg/IfxEray_bf.h
/** \brief  Length for Ifx_ERAY_MBSC3_Bits.MBC66 */
#define IFX_ERAY_MBSC3_MBC66_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MBSC3_Bits.MBC66 */
#define IFX_ERAY_MBSC3_MBC66_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MBSC3_Bits.MBC66 */
#define IFX_ERAY_MBSC3_MBC66_OFF (2u)

/** \brief  Length for Ifx_ERAY_MBSC3_Bits.MBC67 */
#define IFX_ERAY_MBSC3_MBC67_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MBSC3_Bits.MBC67 */
#define IFX_ERAY_MBSC3_MBC67_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MBSC3_Bits.MBC67 */
#define IFX_ERAY_MBSC3_MBC67_OFF (3u)

/** \brief  Length for Ifx_ERAY_MBSC3_Bits.MBC68 */
#define IFX_ERAY_MBSC3_MBC68_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MBSC3_Bits.MBC68 */
#define IFX_ERAY_MBSC3_MBC68_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MBSC3_Bits.MBC68 */
#define IFX_ERAY_MBSC3_MBC68_OFF (4u)

/** \brief  Length for Ifx_ERAY_MBSC3_Bits.MBC69 */
#define IFX_ERAY_MBSC3_MBC69_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MBSC3_Bits.MBC69 */
#define IFX_ERAY_MBSC3_MBC69_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MBSC3_Bits.MBC69 */
#define IFX_ERAY_MBSC3_MBC69_OFF (5u)

/** \brief  Length for Ifx_ERAY_MBSC3_Bits.MBC70 */
#define IFX_ERAY_MBSC3_MBC70_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MBSC3_Bits.MBC70 */
#define IFX_ERAY_MBSC3_MBC70_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MBSC3_Bits.MBC70 */
#define IFX_ERAY_MBSC3_MBC70_OFF (6u)

/** \brief  Length for Ifx_ERAY_MBSC3_Bits.MBC71 */
#define IFX_ERAY_MBSC3_MBC71_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MBSC3_Bits.MBC71 */
#define IFX_ERAY_MBSC3_MBC71_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MBSC3_Bits.MBC71 */
#define IFX_ERAY_MBSC3_MBC71_OFF (7u)

/** \brief  Length for Ifx_ERAY_MBSC3_Bits.MBC72 */
#define IFX_ERAY_MBSC3_MBC72_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MBSC3_Bits.MBC72 */
#define IFX_ERAY_MBSC3_MBC72_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MBSC3_Bits.MBC72 */
#define IFX_ERAY_MBSC3_MBC72_OFF (8u)

/** \brief  Length for Ifx_ERAY_MBSC3_Bits.MBC73 */
#define IFX_ERAY_MBSC3_MBC73_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MBSC3_Bits.MBC73 */
#define IFX_ERAY_MBSC3_MBC73_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MBSC3_Bits.MBC73 */
#define IFX_ERAY_MBSC3_MBC73_OFF (9u)

/** \brief  Length for Ifx_ERAY_MBSC3_Bits.MBC74 */
#define IFX_ERAY_MBSC3_MBC74_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MBSC3_Bits.MBC74 */
#define IFX_ERAY_MBSC3_MBC74_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MBSC3_Bits.MBC74 */
#define IFX_ERAY_MBSC3_MBC74_OFF (10u)

/** \brief  Length for Ifx_ERAY_MBSC3_Bits.MBC75 */
#define IFX_ERAY_MBSC3_MBC75_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MBSC3_Bits.MBC75 */
#define IFX_ERAY_MBSC3_MBC75_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MBSC3_Bits.MBC75 */
#define IFX_ERAY_MBSC3_MBC75_OFF (11u)

/** \brief  Length for Ifx_ERAY_MBSC3_Bits.MBC76 */
#define IFX_ERAY_MBSC3_MBC76_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MBSC3_Bits.MBC76 */
#define IFX_ERAY_MBSC3_MBC76_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MBSC3_Bits.MBC76 */
#define IFX_ERAY_MBSC3_MBC76_OFF (12u)

/** \brief  Length for Ifx_ERAY_MBSC3_Bits.MBC77 */
#define IFX_ERAY_MBSC3_MBC77_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MBSC3_Bits.MBC77 */
#define IFX_ERAY_MBSC3_MBC77_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MBSC3_Bits.MBC77 */
#define IFX_ERAY_MBSC3_MBC77_OFF (13u)

/** \brief  Length for Ifx_ERAY_MBSC3_Bits.MBC78 */
#define IFX_ERAY_MBSC3_MBC78_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MBSC3_Bits.MBC78 */
#define IFX_ERAY_MBSC3_MBC78_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MBSC3_Bits.MBC78 */
#define IFX_ERAY_MBSC3_MBC78_OFF (14u)

/** \brief  Length for Ifx_ERAY_MBSC3_Bits.MBC79 */
#define IFX_ERAY_MBSC3_MBC79_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MBSC3_Bits.MBC79 */
#define IFX_ERAY_MBSC3_MBC79_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MBSC3_Bits.MBC79 */
#define IFX_ERAY_MBSC3_MBC79_OFF (15u)

/** \brief  Length for Ifx_ERAY_MBSC3_Bits.MBC80 */
#define IFX_ERAY_MBSC3_MBC80_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MBSC3_Bits.MBC80 */
#define IFX_ERAY_MBSC3_MBC80_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MBSC3_Bits.MBC80 */
#define IFX_ERAY_MBSC3_MBC80_OFF (16u)

/** \brief  Length for Ifx_ERAY_MBSC3_Bits.MBC81 */
#define IFX_ERAY_MBSC3_MBC81_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MBSC3_Bits.MBC81 */
#define IFX_ERAY_MBSC3_MBC81_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MBSC3_Bits.MBC81 */
#define IFX_ERAY_MBSC3_MBC81_OFF (17u)

/** \brief  Length for Ifx_ERAY_MBSC3_Bits.MBC82 */
#define IFX_ERAY_MBSC3_MBC82_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MBSC3_Bits.MBC82 */
#define IFX_ERAY_MBSC3_MBC82_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MBSC3_Bits.MBC82 */
#define IFX_ERAY_MBSC3_MBC82_OFF (18u)

/** \brief  Length for Ifx_ERAY_MBSC3_Bits.MBC83 */
#define IFX_ERAY_MBSC3_MBC83_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MBSC3_Bits.MBC83 */
#define IFX_ERAY_MBSC3_MBC83_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MBSC3_Bits.MBC83 */
#define IFX_ERAY_MBSC3_MBC83_OFF (19u)

/** \brief  Length for Ifx_ERAY_MBSC3_Bits.MBC84 */
#define IFX_ERAY_MBSC3_MBC84_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MBSC3_Bits.MBC84 */
#define IFX_ERAY_MBSC3_MBC84_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MBSC3_Bits.MBC84 */
#define IFX_ERAY_MBSC3_MBC84_OFF (20u)

/** \brief  Length for Ifx_ERAY_MBSC3_Bits.MBC85 */
#define IFX_ERAY_MBSC3_MBC85_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MBSC3_Bits.MBC85 */
#define IFX_ERAY_MBSC3_MBC85_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MBSC3_Bits.MBC85 */
#define IFX_ERAY_MBSC3_MBC85_OFF (21u)

/** \brief  Length for Ifx_ERAY_MBSC3_Bits.MBC86 */
#define IFX_ERAY_MBSC3_MBC86_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MBSC3_Bits.MBC86 */
#define IFX_ERAY_MBSC3_MBC86_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MBSC3_Bits.MBC86 */
#define IFX_ERAY_MBSC3_MBC86_OFF (22u)

/** \brief  Length for Ifx_ERAY_MBSC3_Bits.MBC87 */
#define IFX_ERAY_MBSC3_MBC87_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MBSC3_Bits.MBC87 */
#define IFX_ERAY_MBSC3_MBC87_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MBSC3_Bits.MBC87 */
#define IFX_ERAY_MBSC3_MBC87_OFF (23u)

/** \brief  Length for Ifx_ERAY_MBSC3_Bits.MBC88 */
#define IFX_ERAY_MBSC3_MBC88_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MBSC3_Bits.MBC88 */
#define IFX_ERAY_MBSC3_MBC88_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MBSC3_Bits.MBC88 */
#define IFX_ERAY_MBSC3_MBC88_OFF (24u)

/** \brief  Length for Ifx_ERAY_MBSC3_Bits.MBC89 */
#define IFX_ERAY_MBSC3_MBC89_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MBSC3_Bits.MBC89 */
#define IFX_ERAY_MBSC3_MBC89_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MBSC3_Bits.MBC89 */
#define IFX_ERAY_MBSC3_MBC89_OFF (25u)

/** \brief  Length for Ifx_ERAY_MBSC3_Bits.MBC90 */
#define IFX_ERAY_MBSC3_MBC90_LEN (1u)

