feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Prog/Libraries/Infra/Sfr/TC27D/_Reg/IfxEray_bf.h
/** \brief  Offset for Ifx_ERAY_NDAT2_Bits.ND56 */
#define IFX_ERAY_NDAT2_ND56_OFF (24u)

/** \brief  Length for Ifx_ERAY_NDAT2_Bits.ND57 */
#define IFX_ERAY_NDAT2_ND57_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT2_Bits.ND57 */
#define IFX_ERAY_NDAT2_ND57_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT2_Bits.ND57 */
#define IFX_ERAY_NDAT2_ND57_OFF (25u)

/** \brief  Length for Ifx_ERAY_NDAT2_Bits.ND58 */
#define IFX_ERAY_NDAT2_ND58_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT2_Bits.ND58 */
#define IFX_ERAY_NDAT2_ND58_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT2_Bits.ND58 */
#define IFX_ERAY_NDAT2_ND58_OFF (26u)

/** \brief  Length for Ifx_ERAY_NDAT2_Bits.ND59 */
#define IFX_ERAY_NDAT2_ND59_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT2_Bits.ND59 */
#define IFX_ERAY_NDAT2_ND59_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT2_Bits.ND59 */
#define IFX_ERAY_NDAT2_ND59_OFF (27u)

/** \brief  Length for Ifx_ERAY_NDAT2_Bits.ND60 */
#define IFX_ERAY_NDAT2_ND60_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT2_Bits.ND60 */
#define IFX_ERAY_NDAT2_ND60_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT2_Bits.ND60 */
#define IFX_ERAY_NDAT2_ND60_OFF (28u)

/** \brief  Length for Ifx_ERAY_NDAT2_Bits.ND61 */
#define IFX_ERAY_NDAT2_ND61_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT2_Bits.ND61 */
#define IFX_ERAY_NDAT2_ND61_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT2_Bits.ND61 */
#define IFX_ERAY_NDAT2_ND61_OFF (29u)

/** \brief  Length for Ifx_ERAY_NDAT2_Bits.ND62 */
#define IFX_ERAY_NDAT2_ND62_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT2_Bits.ND62 */
#define IFX_ERAY_NDAT2_ND62_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT2_Bits.ND62 */
#define IFX_ERAY_NDAT2_ND62_OFF (30u)

/** \brief  Length for Ifx_ERAY_NDAT2_Bits.ND63 */
#define IFX_ERAY_NDAT2_ND63_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT2_Bits.ND63 */
#define IFX_ERAY_NDAT2_ND63_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT2_Bits.ND63 */
#define IFX_ERAY_NDAT2_ND63_OFF (31u)

/** \brief  Length for Ifx_ERAY_NDAT3_Bits.ND64 */
#define IFX_ERAY_NDAT3_ND64_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT3_Bits.ND64 */
#define IFX_ERAY_NDAT3_ND64_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT3_Bits.ND64 */
#define IFX_ERAY_NDAT3_ND64_OFF (0u)

/** \brief  Length for Ifx_ERAY_NDAT3_Bits.ND65 */
#define IFX_ERAY_NDAT3_ND65_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT3_Bits.ND65 */
#define IFX_ERAY_NDAT3_ND65_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT3_Bits.ND65 */
#define IFX_ERAY_NDAT3_ND65_OFF (1u)

/** \brief  Length for Ifx_ERAY_NDAT3_Bits.ND66 */
#define IFX_ERAY_NDAT3_ND66_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT3_Bits.ND66 */
#define IFX_ERAY_NDAT3_ND66_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT3_Bits.ND66 */
#define IFX_ERAY_NDAT3_ND66_OFF (2u)

/** \brief  Length for Ifx_ERAY_NDAT3_Bits.ND67 */
#define IFX_ERAY_NDAT3_ND67_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT3_Bits.ND67 */
#define IFX_ERAY_NDAT3_ND67_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT3_Bits.ND67 */
#define IFX_ERAY_NDAT3_ND67_OFF (3u)

/** \brief  Length for Ifx_ERAY_NDAT3_Bits.ND68 */
#define IFX_ERAY_NDAT3_ND68_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT3_Bits.ND68 */
#define IFX_ERAY_NDAT3_ND68_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT3_Bits.ND68 */
#define IFX_ERAY_NDAT3_ND68_OFF (4u)

/** \brief  Length for Ifx_ERAY_NDAT3_Bits.ND69 */
#define IFX_ERAY_NDAT3_ND69_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT3_Bits.ND69 */
#define IFX_ERAY_NDAT3_ND69_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT3_Bits.ND69 */
#define IFX_ERAY_NDAT3_ND69_OFF (5u)

/** \brief  Length for Ifx_ERAY_NDAT3_Bits.ND70 */
#define IFX_ERAY_NDAT3_ND70_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT3_Bits.ND70 */
#define IFX_ERAY_NDAT3_ND70_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT3_Bits.ND70 */
#define IFX_ERAY_NDAT3_ND70_OFF (6u)

/** \brief  Length for Ifx_ERAY_NDAT3_Bits.ND71 */
#define IFX_ERAY_NDAT3_ND71_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT3_Bits.ND71 */
#define IFX_ERAY_NDAT3_ND71_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT3_Bits.ND71 */
#define IFX_ERAY_NDAT3_ND71_OFF (7u)

/** \brief  Length for Ifx_ERAY_NDAT3_Bits.ND72 */
#define IFX_ERAY_NDAT3_ND72_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT3_Bits.ND72 */
#define IFX_ERAY_NDAT3_ND72_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT3_Bits.ND72 */
#define IFX_ERAY_NDAT3_ND72_OFF (8u)

/** \brief  Length for Ifx_ERAY_NDAT3_Bits.ND73 */
#define IFX_ERAY_NDAT3_ND73_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT3_Bits.ND73 */
#define IFX_ERAY_NDAT3_ND73_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT3_Bits.ND73 */
#define IFX_ERAY_NDAT3_ND73_OFF (9u)

/** \brief  Length for Ifx_ERAY_NDAT3_Bits.ND74 */
#define IFX_ERAY_NDAT3_ND74_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT3_Bits.ND74 */
#define IFX_ERAY_NDAT3_ND74_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT3_Bits.ND74 */
#define IFX_ERAY_NDAT3_ND74_OFF (10u)

/** \brief  Length for Ifx_ERAY_NDAT3_Bits.ND75 */
#define IFX_ERAY_NDAT3_ND75_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT3_Bits.ND75 */
#define IFX_ERAY_NDAT3_ND75_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT3_Bits.ND75 */
#define IFX_ERAY_NDAT3_ND75_OFF (11u)

/** \brief  Length for Ifx_ERAY_NDAT3_Bits.ND76 */
#define IFX_ERAY_NDAT3_ND76_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT3_Bits.ND76 */
#define IFX_ERAY_NDAT3_ND76_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT3_Bits.ND76 */
#define IFX_ERAY_NDAT3_ND76_OFF (12u)

/** \brief  Length for Ifx_ERAY_NDAT3_Bits.ND77 */
#define IFX_ERAY_NDAT3_ND77_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT3_Bits.ND77 */
#define IFX_ERAY_NDAT3_ND77_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT3_Bits.ND77 */
#define IFX_ERAY_NDAT3_ND77_OFF (13u)

/** \brief  Length for Ifx_ERAY_NDAT3_Bits.ND78 */
#define IFX_ERAY_NDAT3_ND78_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT3_Bits.ND78 */
#define IFX_ERAY_NDAT3_ND78_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT3_Bits.ND78 */
#define IFX_ERAY_NDAT3_ND78_OFF (14u)

/** \brief  Length for Ifx_ERAY_NDAT3_Bits.ND79 */
#define IFX_ERAY_NDAT3_ND79_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT3_Bits.ND79 */
#define IFX_ERAY_NDAT3_ND79_MSK (0x1u)

