feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Prog/Libraries/Infra/Sfr/TC27D/_Reg/IfxEray_bf.h
/** \brief  Length for Ifx_ERAY_NDAT4_Bits.ND106 */
#define IFX_ERAY_NDAT4_ND106_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT4_Bits.ND106 */
#define IFX_ERAY_NDAT4_ND106_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT4_Bits.ND106 */
#define IFX_ERAY_NDAT4_ND106_OFF (10u)

/** \brief  Length for Ifx_ERAY_NDAT4_Bits.ND107 */
#define IFX_ERAY_NDAT4_ND107_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT4_Bits.ND107 */
#define IFX_ERAY_NDAT4_ND107_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT4_Bits.ND107 */
#define IFX_ERAY_NDAT4_ND107_OFF (11u)

/** \brief  Length for Ifx_ERAY_NDAT4_Bits.ND108 */
#define IFX_ERAY_NDAT4_ND108_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT4_Bits.ND108 */
#define IFX_ERAY_NDAT4_ND108_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT4_Bits.ND108 */
#define IFX_ERAY_NDAT4_ND108_OFF (12u)

/** \brief  Length for Ifx_ERAY_NDAT4_Bits.ND109 */
#define IFX_ERAY_NDAT4_ND109_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT4_Bits.ND109 */
#define IFX_ERAY_NDAT4_ND109_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT4_Bits.ND109 */
#define IFX_ERAY_NDAT4_ND109_OFF (13u)

/** \brief  Length for Ifx_ERAY_NDAT4_Bits.ND110 */
#define IFX_ERAY_NDAT4_ND110_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT4_Bits.ND110 */
#define IFX_ERAY_NDAT4_ND110_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT4_Bits.ND110 */
#define IFX_ERAY_NDAT4_ND110_OFF (14u)

/** \brief  Length for Ifx_ERAY_NDAT4_Bits.ND111 */
#define IFX_ERAY_NDAT4_ND111_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT4_Bits.ND111 */
#define IFX_ERAY_NDAT4_ND111_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT4_Bits.ND111 */
#define IFX_ERAY_NDAT4_ND111_OFF (15u)

/** \brief  Length for Ifx_ERAY_NDAT4_Bits.ND112 */
#define IFX_ERAY_NDAT4_ND112_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT4_Bits.ND112 */
#define IFX_ERAY_NDAT4_ND112_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT4_Bits.ND112 */
#define IFX_ERAY_NDAT4_ND112_OFF (16u)

/** \brief  Length for Ifx_ERAY_NDAT4_Bits.ND113 */
#define IFX_ERAY_NDAT4_ND113_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT4_Bits.ND113 */
#define IFX_ERAY_NDAT4_ND113_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT4_Bits.ND113 */
#define IFX_ERAY_NDAT4_ND113_OFF (17u)

/** \brief  Length for Ifx_ERAY_NDAT4_Bits.ND114 */
#define IFX_ERAY_NDAT4_ND114_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT4_Bits.ND114 */
#define IFX_ERAY_NDAT4_ND114_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT4_Bits.ND114 */
#define IFX_ERAY_NDAT4_ND114_OFF (18u)

/** \brief  Length for Ifx_ERAY_NDAT4_Bits.ND115 */
#define IFX_ERAY_NDAT4_ND115_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT4_Bits.ND115 */
#define IFX_ERAY_NDAT4_ND115_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT4_Bits.ND115 */
#define IFX_ERAY_NDAT4_ND115_OFF (19u)

/** \brief  Length for Ifx_ERAY_NDAT4_Bits.ND116 */
#define IFX_ERAY_NDAT4_ND116_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT4_Bits.ND116 */
#define IFX_ERAY_NDAT4_ND116_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT4_Bits.ND116 */
#define IFX_ERAY_NDAT4_ND116_OFF (20u)

/** \brief  Length for Ifx_ERAY_NDAT4_Bits.ND117 */
#define IFX_ERAY_NDAT4_ND117_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT4_Bits.ND117 */
#define IFX_ERAY_NDAT4_ND117_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT4_Bits.ND117 */
#define IFX_ERAY_NDAT4_ND117_OFF (21u)

/** \brief  Length for Ifx_ERAY_NDAT4_Bits.ND118 */
#define IFX_ERAY_NDAT4_ND118_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT4_Bits.ND118 */
#define IFX_ERAY_NDAT4_ND118_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT4_Bits.ND118 */
#define IFX_ERAY_NDAT4_ND118_OFF (22u)

/** \brief  Length for Ifx_ERAY_NDAT4_Bits.ND119 */
#define IFX_ERAY_NDAT4_ND119_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT4_Bits.ND119 */
#define IFX_ERAY_NDAT4_ND119_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT4_Bits.ND119 */
#define IFX_ERAY_NDAT4_ND119_OFF (23u)

/** \brief  Length for Ifx_ERAY_NDAT4_Bits.ND120 */
#define IFX_ERAY_NDAT4_ND120_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT4_Bits.ND120 */
#define IFX_ERAY_NDAT4_ND120_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT4_Bits.ND120 */
#define IFX_ERAY_NDAT4_ND120_OFF (24u)

/** \brief  Length for Ifx_ERAY_NDAT4_Bits.ND121 */
#define IFX_ERAY_NDAT4_ND121_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT4_Bits.ND121 */
#define IFX_ERAY_NDAT4_ND121_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT4_Bits.ND121 */
#define IFX_ERAY_NDAT4_ND121_OFF (25u)

/** \brief  Length for Ifx_ERAY_NDAT4_Bits.ND122 */
#define IFX_ERAY_NDAT4_ND122_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT4_Bits.ND122 */
#define IFX_ERAY_NDAT4_ND122_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT4_Bits.ND122 */
#define IFX_ERAY_NDAT4_ND122_OFF (26u)

/** \brief  Length for Ifx_ERAY_NDAT4_Bits.ND123 */
#define IFX_ERAY_NDAT4_ND123_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT4_Bits.ND123 */
#define IFX_ERAY_NDAT4_ND123_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT4_Bits.ND123 */
#define IFX_ERAY_NDAT4_ND123_OFF (27u)

/** \brief  Length for Ifx_ERAY_NDAT4_Bits.ND124 */
#define IFX_ERAY_NDAT4_ND124_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT4_Bits.ND124 */
#define IFX_ERAY_NDAT4_ND124_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT4_Bits.ND124 */
#define IFX_ERAY_NDAT4_ND124_OFF (28u)

/** \brief  Length for Ifx_ERAY_NDAT4_Bits.ND125 */
#define IFX_ERAY_NDAT4_ND125_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT4_Bits.ND125 */
#define IFX_ERAY_NDAT4_ND125_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT4_Bits.ND125 */
#define IFX_ERAY_NDAT4_ND125_OFF (29u)

/** \brief  Length for Ifx_ERAY_NDAT4_Bits.ND126 */
#define IFX_ERAY_NDAT4_ND126_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT4_Bits.ND126 */
#define IFX_ERAY_NDAT4_ND126_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT4_Bits.ND126 */
#define IFX_ERAY_NDAT4_ND126_OFF (30u)

/** \brief  Length for Ifx_ERAY_NDAT4_Bits.ND127 */
#define IFX_ERAY_NDAT4_ND127_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT4_Bits.ND127 */
#define IFX_ERAY_NDAT4_ND127_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT4_Bits.ND127 */
#define IFX_ERAY_NDAT4_ND127_OFF (31u)

/** \brief  Length for Ifx_ERAY_NDAT4_Bits.ND96 */
#define IFX_ERAY_NDAT4_ND96_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT4_Bits.ND96 */
#define IFX_ERAY_NDAT4_ND96_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT4_Bits.ND96 */
#define IFX_ERAY_NDAT4_ND96_OFF (0u)

