feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Prog/Libraries/Infra/Sfr/TC27D/_Reg/IfxEray_bf.h
/** \brief  Offset for Ifx_ERAY_SWNIT_Bits.SENA */
#define IFX_ERAY_SWNIT_SENA_OFF (8u)

/** \brief  Length for Ifx_ERAY_SWNIT_Bits.SENB */
#define IFX_ERAY_SWNIT_SENB_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SWNIT_Bits.SENB */
#define IFX_ERAY_SWNIT_SENB_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SWNIT_Bits.SENB */
#define IFX_ERAY_SWNIT_SENB_OFF (10u)

/** \brief  Length for Ifx_ERAY_SWNIT_Bits.SESA */
#define IFX_ERAY_SWNIT_SESA_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SWNIT_Bits.SESA */
#define IFX_ERAY_SWNIT_SESA_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SWNIT_Bits.SESA */
#define IFX_ERAY_SWNIT_SESA_OFF (0u)

/** \brief  Length for Ifx_ERAY_SWNIT_Bits.SESB */
#define IFX_ERAY_SWNIT_SESB_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SWNIT_Bits.SESB */
#define IFX_ERAY_SWNIT_SESB_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SWNIT_Bits.SESB */
#define IFX_ERAY_SWNIT_SESB_OFF (3u)

/** \brief  Length for Ifx_ERAY_SWNIT_Bits.TCSA */
#define IFX_ERAY_SWNIT_TCSA_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SWNIT_Bits.TCSA */
#define IFX_ERAY_SWNIT_TCSA_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SWNIT_Bits.TCSA */
#define IFX_ERAY_SWNIT_TCSA_OFF (2u)

/** \brief  Length for Ifx_ERAY_SWNIT_Bits.TCSB */
#define IFX_ERAY_SWNIT_TCSB_LEN (1u)

/** \brief  Mask for Ifx_ERAY_SWNIT_Bits.TCSB */
#define IFX_ERAY_SWNIT_TCSB_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_SWNIT_Bits.TCSB */
#define IFX_ERAY_SWNIT_TCSB_OFF (5u)

/** \brief  Length for Ifx_ERAY_T0C_Bits.T0CC */
#define IFX_ERAY_T0C_T0CC_LEN (7u)

/** \brief  Mask for Ifx_ERAY_T0C_Bits.T0CC */
#define IFX_ERAY_T0C_T0CC_MSK (0x7fu)

/** \brief  Offset for Ifx_ERAY_T0C_Bits.T0CC */
#define IFX_ERAY_T0C_T0CC_OFF (8u)

/** \brief  Length for Ifx_ERAY_T0C_Bits.T0MO */
#define IFX_ERAY_T0C_T0MO_LEN (14u)

/** \brief  Mask for Ifx_ERAY_T0C_Bits.T0MO */
#define IFX_ERAY_T0C_T0MO_MSK (0x3fffu)

/** \brief  Offset for Ifx_ERAY_T0C_Bits.T0MO */
#define IFX_ERAY_T0C_T0MO_OFF (16u)

/** \brief  Length for Ifx_ERAY_T0C_Bits.T0MS */
#define IFX_ERAY_T0C_T0MS_LEN (1u)

/** \brief  Mask for Ifx_ERAY_T0C_Bits.T0MS */
#define IFX_ERAY_T0C_T0MS_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_T0C_Bits.T0MS */
#define IFX_ERAY_T0C_T0MS_OFF (1u)

/** \brief  Length for Ifx_ERAY_T0C_Bits.T0RC */
#define IFX_ERAY_T0C_T0RC_LEN (1u)

/** \brief  Mask for Ifx_ERAY_T0C_Bits.T0RC */
#define IFX_ERAY_T0C_T0RC_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_T0C_Bits.T0RC */
#define IFX_ERAY_T0C_T0RC_OFF (0u)

/** \brief  Length for Ifx_ERAY_T1C_Bits.T1MC */
#define IFX_ERAY_T1C_T1MC_LEN (14u)

/** \brief  Mask for Ifx_ERAY_T1C_Bits.T1MC */
#define IFX_ERAY_T1C_T1MC_MSK (0x3fffu)

/** \brief  Offset for Ifx_ERAY_T1C_Bits.T1MC */
#define IFX_ERAY_T1C_T1MC_OFF (16u)

/** \brief  Length for Ifx_ERAY_T1C_Bits.T1MS */
#define IFX_ERAY_T1C_T1MS_LEN (1u)

/** \brief  Mask for Ifx_ERAY_T1C_Bits.T1MS */
#define IFX_ERAY_T1C_T1MS_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_T1C_Bits.T1MS */
#define IFX_ERAY_T1C_T1MS_OFF (1u)

/** \brief  Length for Ifx_ERAY_T1C_Bits.T1RC */
#define IFX_ERAY_T1C_T1RC_LEN (1u)

/** \brief  Mask for Ifx_ERAY_T1C_Bits.T1RC */
#define IFX_ERAY_T1C_T1RC_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_T1C_Bits.T1RC */
#define IFX_ERAY_T1C_T1RC_OFF (0u)

/** \brief  Length for Ifx_ERAY_TEST1_Bits.AOA */
#define IFX_ERAY_TEST1_AOA_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TEST1_Bits.AOA */
#define IFX_ERAY_TEST1_AOA_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TEST1_Bits.AOA */
#define IFX_ERAY_TEST1_AOA_OFF (8u)

/** \brief  Length for Ifx_ERAY_TEST1_Bits.AOB */
#define IFX_ERAY_TEST1_AOB_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TEST1_Bits.AOB */
#define IFX_ERAY_TEST1_AOB_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TEST1_Bits.AOB */
#define IFX_ERAY_TEST1_AOB_OFF (9u)

/** \brief  Length for Ifx_ERAY_TEST1_Bits.CERA */
#define IFX_ERAY_TEST1_CERA_LEN (4u)

/** \brief  Mask for Ifx_ERAY_TEST1_Bits.CERA */
#define IFX_ERAY_TEST1_CERA_MSK (0xfu)

/** \brief  Offset for Ifx_ERAY_TEST1_Bits.CERA */
#define IFX_ERAY_TEST1_CERA_OFF (24u)

/** \brief  Length for Ifx_ERAY_TEST1_Bits.CERB */
#define IFX_ERAY_TEST1_CERB_LEN (4u)

/** \brief  Mask for Ifx_ERAY_TEST1_Bits.CERB */
#define IFX_ERAY_TEST1_CERB_MSK (0xfu)

/** \brief  Offset for Ifx_ERAY_TEST1_Bits.CERB */
#define IFX_ERAY_TEST1_CERB_OFF (28u)

/** \brief  Length for Ifx_ERAY_TEST1_Bits.ELBE */
#define IFX_ERAY_TEST1_ELBE_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TEST1_Bits.ELBE */
#define IFX_ERAY_TEST1_ELBE_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TEST1_Bits.ELBE */
#define IFX_ERAY_TEST1_ELBE_OFF (1u)

/** \brief  Length for Ifx_ERAY_TEST1_Bits.RXA */
#define IFX_ERAY_TEST1_RXA_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TEST1_Bits.RXA */
#define IFX_ERAY_TEST1_RXA_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TEST1_Bits.RXA */
#define IFX_ERAY_TEST1_RXA_OFF (16u)

/** \brief  Length for Ifx_ERAY_TEST1_Bits.RXB */
#define IFX_ERAY_TEST1_RXB_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TEST1_Bits.RXB */
#define IFX_ERAY_TEST1_RXB_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TEST1_Bits.RXB */
#define IFX_ERAY_TEST1_RXB_OFF (17u)

/** \brief  Length for Ifx_ERAY_TEST1_Bits.TMC */
#define IFX_ERAY_TEST1_TMC_LEN (2u)

/** \brief  Mask for Ifx_ERAY_TEST1_Bits.TMC */
#define IFX_ERAY_TEST1_TMC_MSK (0x3u)

/** \brief  Offset for Ifx_ERAY_TEST1_Bits.TMC */
#define IFX_ERAY_TEST1_TMC_OFF (4u)

/** \brief  Length for Ifx_ERAY_TEST1_Bits.TXA */
#define IFX_ERAY_TEST1_TXA_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TEST1_Bits.TXA */
#define IFX_ERAY_TEST1_TXA_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TEST1_Bits.TXA */
#define IFX_ERAY_TEST1_TXA_OFF (18u)

/** \brief  Length for Ifx_ERAY_TEST1_Bits.TXB */
#define IFX_ERAY_TEST1_TXB_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TEST1_Bits.TXB */
#define IFX_ERAY_TEST1_TXB_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TEST1_Bits.TXB */
#define IFX_ERAY_TEST1_TXB_OFF (19u)

/** \brief  Length for Ifx_ERAY_TEST1_Bits.TXENA */
#define IFX_ERAY_TEST1_TXENA_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TEST1_Bits.TXENA */
#define IFX_ERAY_TEST1_TXENA_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TEST1_Bits.TXENA */
#define IFX_ERAY_TEST1_TXENA_OFF (20u)

/** \brief  Length for Ifx_ERAY_TEST1_Bits.TXENB */
#define IFX_ERAY_TEST1_TXENB_LEN (1u)

