feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Prog/Libraries/Infra/Sfr/TC27D/_Reg/IfxEray_bf.h
/** \brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR26 */
#define IFX_ERAY_TXRQ1_TXR26_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR26 */
#define IFX_ERAY_TXRQ1_TXR26_OFF (26u)

/** \brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR27 */
#define IFX_ERAY_TXRQ1_TXR27_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR27 */
#define IFX_ERAY_TXRQ1_TXR27_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR27 */
#define IFX_ERAY_TXRQ1_TXR27_OFF (27u)

/** \brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR28 */
#define IFX_ERAY_TXRQ1_TXR28_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR28 */
#define IFX_ERAY_TXRQ1_TXR28_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR28 */
#define IFX_ERAY_TXRQ1_TXR28_OFF (28u)

/** \brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR29 */
#define IFX_ERAY_TXRQ1_TXR29_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR29 */
#define IFX_ERAY_TXRQ1_TXR29_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR29 */
#define IFX_ERAY_TXRQ1_TXR29_OFF (29u)

/** \brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR2 */
#define IFX_ERAY_TXRQ1_TXR2_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR2 */
#define IFX_ERAY_TXRQ1_TXR2_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR2 */
#define IFX_ERAY_TXRQ1_TXR2_OFF (2u)

/** \brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR30 */
#define IFX_ERAY_TXRQ1_TXR30_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR30 */
#define IFX_ERAY_TXRQ1_TXR30_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR30 */
#define IFX_ERAY_TXRQ1_TXR30_OFF (30u)

/** \brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR31 */
#define IFX_ERAY_TXRQ1_TXR31_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR31 */
#define IFX_ERAY_TXRQ1_TXR31_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR31 */
#define IFX_ERAY_TXRQ1_TXR31_OFF (31u)

/** \brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR3 */
#define IFX_ERAY_TXRQ1_TXR3_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR3 */
#define IFX_ERAY_TXRQ1_TXR3_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR3 */
#define IFX_ERAY_TXRQ1_TXR3_OFF (3u)

/** \brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR4 */
#define IFX_ERAY_TXRQ1_TXR4_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR4 */
#define IFX_ERAY_TXRQ1_TXR4_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR4 */
#define IFX_ERAY_TXRQ1_TXR4_OFF (4u)

/** \brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR5 */
#define IFX_ERAY_TXRQ1_TXR5_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR5 */
#define IFX_ERAY_TXRQ1_TXR5_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR5 */
#define IFX_ERAY_TXRQ1_TXR5_OFF (5u)

/** \brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR6 */
#define IFX_ERAY_TXRQ1_TXR6_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR6 */
#define IFX_ERAY_TXRQ1_TXR6_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR6 */
#define IFX_ERAY_TXRQ1_TXR6_OFF (6u)

/** \brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR7 */
#define IFX_ERAY_TXRQ1_TXR7_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR7 */
#define IFX_ERAY_TXRQ1_TXR7_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR7 */
#define IFX_ERAY_TXRQ1_TXR7_OFF (7u)

/** \brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR8 */
#define IFX_ERAY_TXRQ1_TXR8_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR8 */
#define IFX_ERAY_TXRQ1_TXR8_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR8 */
#define IFX_ERAY_TXRQ1_TXR8_OFF (8u)

/** \brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR9 */
#define IFX_ERAY_TXRQ1_TXR9_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR9 */
#define IFX_ERAY_TXRQ1_TXR9_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR9 */
#define IFX_ERAY_TXRQ1_TXR9_OFF (9u)

/** \brief  Length for Ifx_ERAY_TXRQ2_Bits.TXR32 */
#define IFX_ERAY_TXRQ2_TXR32_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ2_Bits.TXR32 */
#define IFX_ERAY_TXRQ2_TXR32_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ2_Bits.TXR32 */
#define IFX_ERAY_TXRQ2_TXR32_OFF (0u)

/** \brief  Length for Ifx_ERAY_TXRQ2_Bits.TXR33 */
#define IFX_ERAY_TXRQ2_TXR33_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ2_Bits.TXR33 */
#define IFX_ERAY_TXRQ2_TXR33_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ2_Bits.TXR33 */
#define IFX_ERAY_TXRQ2_TXR33_OFF (1u)

/** \brief  Length for Ifx_ERAY_TXRQ2_Bits.TXR34 */
#define IFX_ERAY_TXRQ2_TXR34_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ2_Bits.TXR34 */
#define IFX_ERAY_TXRQ2_TXR34_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ2_Bits.TXR34 */
#define IFX_ERAY_TXRQ2_TXR34_OFF (2u)

/** \brief  Length for Ifx_ERAY_TXRQ2_Bits.TXR35 */
#define IFX_ERAY_TXRQ2_TXR35_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ2_Bits.TXR35 */
#define IFX_ERAY_TXRQ2_TXR35_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ2_Bits.TXR35 */
#define IFX_ERAY_TXRQ2_TXR35_OFF (3u)

/** \brief  Length for Ifx_ERAY_TXRQ2_Bits.TXR36 */
#define IFX_ERAY_TXRQ2_TXR36_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ2_Bits.TXR36 */
#define IFX_ERAY_TXRQ2_TXR36_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ2_Bits.TXR36 */
#define IFX_ERAY_TXRQ2_TXR36_OFF (4u)

/** \brief  Length for Ifx_ERAY_TXRQ2_Bits.TXR37 */
#define IFX_ERAY_TXRQ2_TXR37_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ2_Bits.TXR37 */
#define IFX_ERAY_TXRQ2_TXR37_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ2_Bits.TXR37 */
#define IFX_ERAY_TXRQ2_TXR37_OFF (5u)

/** \brief  Length for Ifx_ERAY_TXRQ2_Bits.TXR38 */
#define IFX_ERAY_TXRQ2_TXR38_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ2_Bits.TXR38 */
#define IFX_ERAY_TXRQ2_TXR38_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ2_Bits.TXR38 */
#define IFX_ERAY_TXRQ2_TXR38_OFF (6u)

/** \brief  Length for Ifx_ERAY_TXRQ2_Bits.TXR39 */
#define IFX_ERAY_TXRQ2_TXR39_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ2_Bits.TXR39 */
#define IFX_ERAY_TXRQ2_TXR39_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ2_Bits.TXR39 */
#define IFX_ERAY_TXRQ2_TXR39_OFF (7u)

/** \brief  Length for Ifx_ERAY_TXRQ2_Bits.TXR40 */
#define IFX_ERAY_TXRQ2_TXR40_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ2_Bits.TXR40 */
#define IFX_ERAY_TXRQ2_TXR40_MSK (0x1u)

