feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Prog/Libraries/Infra/Sfr/TC27D/_Reg/IfxEray_bf.h
/** \brief  Mask for Ifx_ERAY_TXRQ3_Bits.TXR90 */
#define IFX_ERAY_TXRQ3_TXR90_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ3_Bits.TXR90 */
#define IFX_ERAY_TXRQ3_TXR90_OFF (26u)

/** \brief  Length for Ifx_ERAY_TXRQ3_Bits.TXR91 */
#define IFX_ERAY_TXRQ3_TXR91_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ3_Bits.TXR91 */
#define IFX_ERAY_TXRQ3_TXR91_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ3_Bits.TXR91 */
#define IFX_ERAY_TXRQ3_TXR91_OFF (27u)

/** \brief  Length for Ifx_ERAY_TXRQ3_Bits.TXR92 */
#define IFX_ERAY_TXRQ3_TXR92_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ3_Bits.TXR92 */
#define IFX_ERAY_TXRQ3_TXR92_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ3_Bits.TXR92 */
#define IFX_ERAY_TXRQ3_TXR92_OFF (28u)

/** \brief  Length for Ifx_ERAY_TXRQ3_Bits.TXR93 */
#define IFX_ERAY_TXRQ3_TXR93_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ3_Bits.TXR93 */
#define IFX_ERAY_TXRQ3_TXR93_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ3_Bits.TXR93 */
#define IFX_ERAY_TXRQ3_TXR93_OFF (29u)

/** \brief  Length for Ifx_ERAY_TXRQ3_Bits.TXR94 */
#define IFX_ERAY_TXRQ3_TXR94_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ3_Bits.TXR94 */
#define IFX_ERAY_TXRQ3_TXR94_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ3_Bits.TXR94 */
#define IFX_ERAY_TXRQ3_TXR94_OFF (30u)

/** \brief  Length for Ifx_ERAY_TXRQ3_Bits.TXR95 */
#define IFX_ERAY_TXRQ3_TXR95_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ3_Bits.TXR95 */
#define IFX_ERAY_TXRQ3_TXR95_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ3_Bits.TXR95 */
#define IFX_ERAY_TXRQ3_TXR95_OFF (31u)

/** \brief  Length for Ifx_ERAY_TXRQ4_Bits.TXR100 */
#define IFX_ERAY_TXRQ4_TXR100_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ4_Bits.TXR100 */
#define IFX_ERAY_TXRQ4_TXR100_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ4_Bits.TXR100 */
#define IFX_ERAY_TXRQ4_TXR100_OFF (4u)

/** \brief  Length for Ifx_ERAY_TXRQ4_Bits.TXR101 */
#define IFX_ERAY_TXRQ4_TXR101_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ4_Bits.TXR101 */
#define IFX_ERAY_TXRQ4_TXR101_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ4_Bits.TXR101 */
#define IFX_ERAY_TXRQ4_TXR101_OFF (5u)

/** \brief  Length for Ifx_ERAY_TXRQ4_Bits.TXR102 */
#define IFX_ERAY_TXRQ4_TXR102_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ4_Bits.TXR102 */
#define IFX_ERAY_TXRQ4_TXR102_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ4_Bits.TXR102 */
#define IFX_ERAY_TXRQ4_TXR102_OFF (6u)

/** \brief  Length for Ifx_ERAY_TXRQ4_Bits.TXR103 */
#define IFX_ERAY_TXRQ4_TXR103_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ4_Bits.TXR103 */
#define IFX_ERAY_TXRQ4_TXR103_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ4_Bits.TXR103 */
#define IFX_ERAY_TXRQ4_TXR103_OFF (7u)

/** \brief  Length for Ifx_ERAY_TXRQ4_Bits.TXR104 */
#define IFX_ERAY_TXRQ4_TXR104_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ4_Bits.TXR104 */
#define IFX_ERAY_TXRQ4_TXR104_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ4_Bits.TXR104 */
#define IFX_ERAY_TXRQ4_TXR104_OFF (8u)

/** \brief  Length for Ifx_ERAY_TXRQ4_Bits.TXR105 */
#define IFX_ERAY_TXRQ4_TXR105_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ4_Bits.TXR105 */
#define IFX_ERAY_TXRQ4_TXR105_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ4_Bits.TXR105 */
#define IFX_ERAY_TXRQ4_TXR105_OFF (9u)

/** \brief  Length for Ifx_ERAY_TXRQ4_Bits.TXR106 */
#define IFX_ERAY_TXRQ4_TXR106_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ4_Bits.TXR106 */
#define IFX_ERAY_TXRQ4_TXR106_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ4_Bits.TXR106 */
#define IFX_ERAY_TXRQ4_TXR106_OFF (10u)

/** \brief  Length for Ifx_ERAY_TXRQ4_Bits.TXR107 */
#define IFX_ERAY_TXRQ4_TXR107_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ4_Bits.TXR107 */
#define IFX_ERAY_TXRQ4_TXR107_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ4_Bits.TXR107 */
#define IFX_ERAY_TXRQ4_TXR107_OFF (11u)

/** \brief  Length for Ifx_ERAY_TXRQ4_Bits.TXR108 */
#define IFX_ERAY_TXRQ4_TXR108_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ4_Bits.TXR108 */
#define IFX_ERAY_TXRQ4_TXR108_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ4_Bits.TXR108 */
#define IFX_ERAY_TXRQ4_TXR108_OFF (12u)

/** \brief  Length for Ifx_ERAY_TXRQ4_Bits.TXR109 */
#define IFX_ERAY_TXRQ4_TXR109_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ4_Bits.TXR109 */
#define IFX_ERAY_TXRQ4_TXR109_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ4_Bits.TXR109 */
#define IFX_ERAY_TXRQ4_TXR109_OFF (13u)

/** \brief  Length for Ifx_ERAY_TXRQ4_Bits.TXR110 */
#define IFX_ERAY_TXRQ4_TXR110_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ4_Bits.TXR110 */
#define IFX_ERAY_TXRQ4_TXR110_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ4_Bits.TXR110 */
#define IFX_ERAY_TXRQ4_TXR110_OFF (14u)

/** \brief  Length for Ifx_ERAY_TXRQ4_Bits.TXR111 */
#define IFX_ERAY_TXRQ4_TXR111_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ4_Bits.TXR111 */
#define IFX_ERAY_TXRQ4_TXR111_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ4_Bits.TXR111 */
#define IFX_ERAY_TXRQ4_TXR111_OFF (15u)

/** \brief  Length for Ifx_ERAY_TXRQ4_Bits.TXR112 */
#define IFX_ERAY_TXRQ4_TXR112_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ4_Bits.TXR112 */
#define IFX_ERAY_TXRQ4_TXR112_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ4_Bits.TXR112 */
#define IFX_ERAY_TXRQ4_TXR112_OFF (16u)

/** \brief  Length for Ifx_ERAY_TXRQ4_Bits.TXR113 */
#define IFX_ERAY_TXRQ4_TXR113_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ4_Bits.TXR113 */
#define IFX_ERAY_TXRQ4_TXR113_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ4_Bits.TXR113 */
#define IFX_ERAY_TXRQ4_TXR113_OFF (17u)

/** \brief  Length for Ifx_ERAY_TXRQ4_Bits.TXR114 */
#define IFX_ERAY_TXRQ4_TXR114_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ4_Bits.TXR114 */
#define IFX_ERAY_TXRQ4_TXR114_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ4_Bits.TXR114 */
#define IFX_ERAY_TXRQ4_TXR114_OFF (18u)

/** \brief  Length for Ifx_ERAY_TXRQ4_Bits.TXR115 */
#define IFX_ERAY_TXRQ4_TXR115_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ4_Bits.TXR115 */
#define IFX_ERAY_TXRQ4_TXR115_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ4_Bits.TXR115 */
#define IFX_ERAY_TXRQ4_TXR115_OFF (19u)

/** \brief  Length for Ifx_ERAY_TXRQ4_Bits.TXR116 */
#define IFX_ERAY_TXRQ4_TXR116_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ4_Bits.TXR116 */
#define IFX_ERAY_TXRQ4_TXR116_MSK (0x1u)

